import pandas as pd
import streamlit as st

prod_type = '油類'

# 瀏覽器頁籤
st.set_page_config(page_title=prod_type, layout="wide")

# 網頁標題
st.header(prod_type)

# sidebar navigation
st.sidebar.page_link('st.py', label='公司介紹')
st.sidebar.page_link('pages/page_1.py',  label='糖類')
st.sidebar.page_link('pages/page_2.py',  label='麵粉類')
st.sidebar.page_link('pages/page_3.py',  label='粉類')
st.sidebar.page_link('pages/page_4.py',  label='油類')
st.sidebar.page_link('pages/page_5.py',  label='調味料')
st.sidebar.page_link('pages/page_6.py',  label='醬油類')
st.sidebar.page_link('pages/page_7.py',  label='罐頭類')
st.sidebar.page_link('pages/page_8.py',  label='農產品')
st.sidebar.page_link('pages/page_9.py',  label='海產類')
st.sidebar.page_link('pages/page_10.py', label='豆類')
st.sidebar.page_link('pages/page_11.py', label='中藥')
st.sidebar.page_link('pages/page_12.py', label='雜貨類')
st.sidebar.page_link('pages/page_13.py', label='冰用品')
st.sidebar.page_link('pages/page_14.py', label='茶咖啡')
st.sidebar.page_link('pages/page_15.py', label='王子麵')
st.sidebar.page_link('pages/page_16.py', label='泡麵類')
st.sidebar.page_link('pages/page_17.py', label='香辛料')

# 欄位排列
# left_column, right_column = st.columns(2)

# 製造間距
st.write(f"")
st.write(f"")
st.write(f"")

# 網頁子標題
st.write('產品細項')

data = {
    "貨品編號": [
        "1401100", "1401200", "1402000", "1402100",  "1402200",  "1402202", "1403000", "1404000", 
        "1404001", "1404002", "1405001", "1405002",  "1405005",  "1405215", "1405217", "1405224", 
        "1405225", "1406212", "1406222", "1407252",  "1407253",  "1407260", "1408003", "1408009", 
        "1408102", "1408201", "1408300", "1408302",  "1408513",  "1408608", "1408648", "1408650", 
        "1408652", "1408655", "1408657", "1408660",  "1408700",  "1408800", "1408810", "1408900", 
        "1408911", "1408920", "1408922", "1409200",  "1409400",  "1409505", "1409506", "1410002", 
        "1410008", "1410012", "1410110", "1410210",  "1411002",  "1411005", "1411008", "1411120", 
        "1411125", "1411130", "1411400", "1411413",  "1411420",  "1411422", "1411428", "1411430", 
        "1411432", "1411437", "1412000", "1413040",  "1413042",  "1414015", "1414019", "1414023", 
        "1414026", "1414035", "1414042", "1414050",  "1414051",  "1414052", "1414053", "1417002", 
        "1418000", "1418002", "1419000", "1419302",  "1419312",  "1419404", "1419410", "1419420", 
        "1419430", "1419439", "1421097", "1421118",  "1421120",  "1421122", "1421131", "1421133", 
        "1421144", "1421146", "1421159", "14086591", "14211001", "1421160"
    ],
    "貨品名稱": [
        '大成沙拉油１８公升',
        '大成沙拉油3L-6入',
        '泰山沙拉油１８ＫＧ',
        '泰山沙拉油１８公升',
        '泰山沙拉油3L-6入',
        '泰山沙拉油0.6L-12入',
        '聯福沙拉油１８ＫＧ',
        '美食家沙拉油１８Ｌ',
        '美食家沙拉油１８ＫＧ',
        '美食家沙拉油3L-6入',
        '美食家＜芥花油＞18公升',
        '美食家*芥花油2.6公升-6入',
        '泰山芥花油-18L',
        '美食家耐炸油18Ｌ(綠)',
        '美食家*好炸油*18公升(藍)',
        '聯福烹調油-18L',
        '聯福(耐炸油18L',
        '統清(耐炸豬油)15K',
        '東原純豬油-15k',
        '統清瑪其琳-16KG',
        '統清**酥油-15KG',
        '南僑酥油16.5KG',
        '(新)聯合香油3L-6入(富味香',
        '富香高級香油3L-6入',
        '(新)大班香油3L-6入(富味香',
        '福壽香油3L-6入',
        '富香香油2.8L-6入*',
        '富香尚介香香油3K-6入',
        '太香香油3L-6入(富味香)',
        '鼎上溱香油3L-6入(白色箱',
        '王牌香油2.8L-6入',
        '(發)頂好香油0.6L-12入',
        '(發)頂好香油230ml-12入',
        '(發)小磨香油(紅標)3L-6入',
        '(發)小磨香油450cc紅標12',
        '(發)頂好香油(綠標)3L-6入',
        '大馬記香油520ml-12入',
        '中馬記香油230ml-12入',
        '馬記香油３Ｌ-6入',
        '獅牌香油3L-6入',
        '獅牌純香油500ml-12入',
        '獅牌香油0.3KG-12入',
        '獅牌香油500ml-12入',
        '富香花生風味油2L-6入',
        '富香花生油２.６L-6入',
        '(發)花生油230ml-12入',
        '(發)花生油500ml-12入',
        '飛馬辣油3KG-6入',
        '富香-尚介香辣油3K-6入',
        'BB辣油-2.4KG',
        '飛馬辣油玻璃450G-12入',
        '飛馬辣油<塑膠>小210g-1',
        '富香黑麻油3L-6入',
        '福壽黑麻油-3L-6入',
        '鼎上溱黑麻油3L-6入(咖啡',
        '富味鄉黑麻油3公斤-6入(聯',
        '富香古早味黑麻油3L-6入',
        '富味鄉*薑麻油500CC-12入',
        '獅牌純黑麻油鐵罐3KG-6入',
        '獅牌(塑膠)黑麻油3L-6入',
        '獅牌黑麻油220ml-12入',
        '獅牌純黑麻油500ml-12入',
        '王牌黑麻油2.8L-6入',
        '發*綠標*胡麻油500ml-12',
        '<發>黑麻油(綠標)230ml-1',
        '發*紅標*黑麻油500cc-12入',
        '民星-馬祖蝦油0.6L-12入',
        '富香三多健康油2.6L-6入(葵',
        '富香三多健康油*2L-6入(葵',
        '奧利塔純橄欖油1L-9入',
        '白松露橄欖油-主廚專用(鐵)',
        '奧利塔玄米油1L-9入',
        '奧利塔葡萄籽油1L-9入',
        '奧利(初榨)橄欖油3L-4入',
        '奧利塔高溫葵花油3L-4入',
        '安柏橄欖粕油3L-6入(河洛)',
        '河洛橄欖油1公升-12入(特',
        '奧利塔葵花油-1公升-9入',
        'Costa doro橄欖油5L-4入(',
        '安特-杏仁露300ml-12入',
        '易開菊花奶油450g-12入*',
        '幸福乳珈琳3K*6入',
        '沙拉-大６袋入(上典)',
        '康寶沙拉500gx20',
        '(康寶)千島沙拉2.5L-6入',
        '(日本)優比沙拉450g-20入',
        '(味全)沙拉500gx12',
        '(味全)千島沙拉1kg-6入',
        '憶霖蜂蜜芥末沙拉500g-20',
        '憶霖千島沙拉1K-16入',
        '(發)苦茶油210ml-12入',
        '味全和風芥子醬660ML-6入',
        '味全焙煎芝麻醬1070g*6入',
        '味全和風柚子醬600cc-6入',
        '味滋康和風沙拉 1L-芥末8入',
        '味滋康和風沙拉-芝麻1L-8',
        '四季胡麻沙拉醬950ml-12',
        '四季日式和風醬950ml-12',
        '味全凱薩淋醬0.6L-6入',
        '(發)純香油-520ml-12入',
        '(發)苦茶油500ml-12入',
        'KEWPIE焙煎胡麻醬1L-9入'
    ],
    "單位": [
        '件', '件', '件', '件', '件', '箱', '件', '件', '件', '件', '件', '件', '件', '件', 
        '件', '件', '件', '件', '件', '件', '件', '件', '箱', '箱', '箱', '箱', '箱', '箱', 
        '箱', '箱', '箱', '箱', '箱', '箱', '箱', '箱', '箱', '箱', '箱', '箱', '箱', '箱', 
        '箱', '箱', '箱', '箱', '箱', '箱', '箱', '箱', '箱', '箱', '箱', '箱', '箱', '箱', 
        '箱', '箱', '箱', '箱', '箱', '箱', '箱', '箱', '箱', '箱', '箱', '箱', '箱', '箱', 
        '件', '箱', '箱', '箱', '箱', '件', '件', '箱', '箱', '箱', '件', '箱', '箱', '箱', 
        '箱', '箱', '箱', '箱', '件', '件', '箱', '件', '件', '件', '件', '件', '件', '件', 
        '件', '箱', '箱', '件'
    ]
}

df = pd.DataFrame(data)
st.dataframe(df, use_container_width=True)
