import pandas as pd
import streamlit as st

prod_type = '粉類'

# 瀏覽器頁籤
st.set_page_config(page_title=prod_type, layout="wide")

# 網頁標題
st.header(prod_type)

# sidebar navigation
st.sidebar.page_link('st.py', label='公司介紹')
st.sidebar.page_link('pages/page_1.py',  label='糖類')
st.sidebar.page_link('pages/page_2.py',  label='麵粉類')
st.sidebar.page_link('pages/page_3.py',  label='粉類')
st.sidebar.page_link('pages/page_4.py',  label='油類')
st.sidebar.page_link('pages/page_5.py',  label='調味料')
st.sidebar.page_link('pages/page_6.py',  label='醬油類')
st.sidebar.page_link('pages/page_7.py',  label='罐頭類')
st.sidebar.page_link('pages/page_8.py',  label='農產品')
st.sidebar.page_link('pages/page_9.py',  label='海產類')
st.sidebar.page_link('pages/page_10.py', label='豆類')
st.sidebar.page_link('pages/page_11.py', label='中藥')
st.sidebar.page_link('pages/page_12.py', label='雜貨類')
st.sidebar.page_link('pages/page_13.py', label='冰用品')
st.sidebar.page_link('pages/page_14.py', label='茶咖啡')
st.sidebar.page_link('pages/page_15.py', label='王子麵')
st.sidebar.page_link('pages/page_16.py', label='泡麵類')
st.sidebar.page_link('pages/page_17.py', label='香辛料')

# 欄位排列
# left_column, right_column = st.columns(2)

# 製造間距
st.write(f"")
st.write(f"")
st.write(f"")

# 網頁子標題
st.write('產品細項')

data = {
    "貨品編號": [
        "1301100",  "1301200", "1301300", "1302100", "1302200", "1302300", 
        "1302600",  "1302603", "1303200", "1303300", "1303310", "1303400", 
        "1304200",  "1305003", "1305100", "1305110", "1306000", "1307007", 
        "1307009",  "1308004", "1310000", "1311100", "1311104", "1312000", 
        "1312003",  "1312203", "1312402", "1312404", "1313002", "1313050", 
        "1313102",  "1314004", "1314010", "1314200", "1314400", "1315000", 
        "1315002",  "1315003", "1315100", "1315103", "1315311", "1316000", 
        "1316010",  "1316022", "1316408", "1316450", "1316500", "1317100", 
        "1317300",  "1317410", "1317419", "1317701", "1317810", "1317910", 
        "1317915",  "1318000", "1318002", "1318005", "1318006", "1318007", 
        "1318100",  "1318201", "1318202", "1318300", "1318304", "1318305", 
        "1320000",  "1320015", "1320020", "1320023", "1320032", "1320042", 
        "1320052",  "1320100", "1321147", "1321745", "1323005", "1323100", 
        "1323104",  "1323107", "1324000", "1324006", "1326003", "1333012", 
        "1333014",  "1333111", "1333115", "1333119", "1333122", "13200121", 
        "13240101", "13240123"
    ],
    "貨品名稱": [
        "日片-青25KG",
        "日片-風車25KG",
        "日片-歐25KG<s>",
        "清粉-志20KG",
        "清粉-米20KG",
        "清粉-泰花20KG",
        "清粉＜風車＞20KG",
        "SU 清粉-20KG",
        "太白粉<三角牌>20KG",
        "太白粉<鷹>-20KG",
        "太白粉<珍珠牌>-20KG",
        "太白粉-泰花50KG",
        "紅粉-啟20KG",
        "台榮玉米粉25KG",
        "玉米粉(玉米寶寶375g-24入",
        "玉米粉<仙姑>0.4KG-24入",
        "小蘇打25KG",
        "<輕>鹼粉食用-２５公斤",
        "<食用>重*鹼粉-25KG",
        "<食用>凡粉25KG",
        "銨粉25KG(白色塑膠袋裝)",
        "橙粉25KG(小麥澱粉)",
        "(需預訂)日本葛粉絲500G-2",
        "粉圓20KG",
        "(大顆)粉圓20KG",
        "山粉圓-36KG",
        "禾豐白QQ-1斤-24入",
        "禾豐黑粉圓1斤-24入",
        "燦和麵包粉3KG-7入",
        "仙知味(黃)麵包粉3KG-8入",
        "燦和-麵包粉500G-42入",
        "(福鹿)糯米粉-30KG",
        "＜水磨屏東＞糯米粉-30KG",
        "福鹿糯米粉1斤-20入",
        "(屏東)糯米粉600G-20入",
        "(福鹿)在來粉-30KG",
        "(屏東)在來粉-30KG",
        "(屏東)在來粉600G-20入",
        "福鹿在來粉600G-20入",
        "屏農-蓬萊米粉600G",
        "金錢豹(蘿蔔糕粉)500g-24",
        "<瑞>發粿粉(無糖)600g20",
        "一路發發粿粉1KG-12入",
        "金錢豹-黑糖發粿粉1KG-12",
        "金錢豹蚵仔煎粉250G-24入",
        "金錢豹鬆餅粉500g-24入",
        "仙知味鬆餅粉1KG-12入",
        "龍口冬粉30KG",
        "福祿冬粉--30KG",
        "(津)冬粉２４Ｋ",
        "(鴻福)冬粉３０Ｋ",
        "龍口冬粉3入-40入",
        "蝴蝶蘭冬粉500G-15入",
        "龍口冬粉*1斤30包入",
        "龍口櫻花冬粉3K-10入",
        "虎牌米粉30入",
        "虎牌大包丸50g米粉>10袋",
        "虎牌小包丸米粉40g>6袋入",
        "虎牌中粗米粉20斤-黃",
        "虎牌大粗米粉20斤-紅",
        "龍口米粉40入",
        "埔里米粉-中粗400G-15入",
        "埔里米粉-大粗400G-15入",
        "(福樂)米粉-30入",
        "福樂大包丸40g米粉>10袋",
        "福樂小包丸15粒-10袋入",
        "黏師父脆酥粉1KG-12入",
        "金錢豹起司脆酥粉500G-24",
        "金錢豹脆皮卡啦粉1KG-12",
        "小磨坊脆皮麟片炸雞粉1kg-",
        "金錢豹茶碗蒸魚板玉米20g-",
        "金錢豹茶碗蒸香菇豌豆20g-",
        "金錢豹茶碗蒸干貝蟹肉20g-",
        "黏師父脆酥粉500G-24入",
        "天之山-咖啡凍粉1KG-30包",
        "天之山雞蛋布丁粉1K-30入(",
        "一心豆花粉10小入-30袋",
        "薌園-豆漿粉1KG-20入",
        "薌園-營養豆漿粉-500g-12",
        "薌園-豆漿粉(無糖)-500g-2",
        "birds吉斯粉(卡士達粉)300",
        "帕馬森乳酪粉1kg-8入(河洛",
        "泡打粉3KG-6入",
        "越南*(寬)*河粉450G-20入",
        "越南河粉(細米線)-500g-20",
        "中農<粉條>500G-50包入(",
        "中農<寬粉絲>35g-40包入",
        "龍口粉條600G-30包入＊＊",
        "龍口<寬>冬粉-40小包入",
        "金錢豹<酥漿粉>1KG-12入",
        "永詮-吉利Ｔ粉1KG-20入",
        "永詮-吉利T粉200g-36入"
    ],
    "單位": [
        '件', '件', '件', '件', '件', '件', '件', '件', '件', '件', 
        '件', '件', '件', '件', '箱', '箱', '件', '箱', '件', '箱',
        '箱', '件', '件', '件', '件', '件', '箱', '箱', '箱', '箱',
        '箱', '件', '件', '箱', '箱', '件', '件', '箱', '箱', '箱',
        '箱', '箱', '箱', '箱', '箱', '箱', '件', '件', '件', '件',
        '件', '件', '件', '件', '件', '件', '件', '件', '件', '件',
        '件', '件', '件', '件', '件', '件', '箱', '箱', '箱', '箱',
        '箱', '箱', '箱', '箱', '箱', '箱', '箱', '箱', '箱', '箱',
        '箱', '件', '箱', '件', '件', '件', '件', '件', '件', '箱',
        '箱', '箱'
    ]
}

df = pd.DataFrame(data)
st.dataframe(df, use_container_width=True)
